// Написать программу замену элементов массива на противоположные на -
int [] array = {1,2,3,4,5,6};
var result = array.Reverse().ToList();
result.ForEach(i => Console.WriteLine(i));

